extends 子场景


## 获取当前玩家角色. 
func 尝试获取子场景内玩家角色()->玩家角色:
	for i in 角色列表:
		if i is 玩家角色:
			return i
	push_error("未能获取到玩家.")
	return


func 获取玩家建筑物建造者组件() -> 组件_建筑物建造者:
	if 尝试获取子场景内玩家角色():
		if 尝试获取子场景内玩家角色().建筑物建造者组件:
			return 尝试获取子场景内玩家角色().建筑物建造者组件
	push_error("未能获取到玩家建筑物建造者组件")
	return


func _on_切换到_无蓝图_pressed() -> void:
	if 获取玩家建筑物建造者组件():
		获取玩家建筑物建造者组件().设置当前手上的蓝图实例(null)


func _on_切换到_试作型投射物防御塔_pressed() -> void:
	if 获取玩家建筑物建造者组件():
		获取玩家建筑物建造者组件().设置当前手上的蓝图实例(资源管理器.蓝图预制件_机枪塔.instantiate())


func _on_切换到_试作型电弧防御塔_pressed() -> void:
	if 获取玩家建筑物建造者组件():
		获取玩家建筑物建造者组件().设置当前手上的蓝图实例(资源管理器.蓝图预制件_特斯拉塔.instantiate())


func _on_切换到_建筑房子_pressed() -> void:
	if 获取玩家建筑物建造者组件():
		获取玩家建筑物建造者组件().设置当前手上的蓝图实例(资源管理器.蓝图预制件_测试房子.instantiate())
